:PROPERTIES:
:UNNUMBERED: t
:END:
#+STARTUP: fninline
#+title: Whatever - #01
{{{title-h1}}}

* our org ssg


#+begin_src elisp
(setq org-export-global-macros '(("sidenote" . "\n@@html: <label for=$1 class=\"margin-toggle sidenote-number\"></label>
 <input type=\"checkbox\" id=$1 class=\"margin-toggle\"/>
 <span class=\"sidenote\"> $2 </span>@@")
                                 ("marginnote" . "\n@@html: <label for=$1 class=\"margin-toggle\">⊕</label>
 <input type=\"checkbox\" id=$1 class=\"margin-toggle\"/>
 <span class=\"marginnote\"> $2 </span>@@")
                                 ("bold" . "@@html: <b> $1 </b>@@")
                                 ("emph" . "@@html: <i> $1 </i>@@")
                                 ("title-h1" . "(eval (format \"@@html:<h1>%s</h1>@@\" (cdr (car (org-collect-keywords '(\"TITLE\"))))))")
                                 ("title-h1z". "@@html:<h1>{{{title}}}</h1>@@")))
(setq org-publish-project-alist '())
(let ((basedir (expand-file-name (project-root (project-current)))))
  (progn
    (defun dld-copy-css (_PROP) (shell-command
                                 (format "%scopy-tufte.sh" (expand-file-name (project-root (project-current))))))
    (defun prep-fun (_PROP)
      (setq org-export-htmlize-output-type nil)
      (setq org-html-htmlize-output-type nil))
    (add-to-list 'org-publish-project-alist `("dld"
                                              :publishing-directory
                                              ,(concat basedir "public/dld")
                                              :base-directory
                                              ,(concat basedir "site/dld")
                                              :with-toc nil
                                              :html-head-include-default-style nil
                                              :html-doctype "html5"
                                              :htmlized-source nil
                                              :htmlize-output nil
                                              :with-title nil
                                              :with-broken-links 't
                                              :html-html5-fancy 't
                                              :completion-function dld-copy-css
                                              :preparation-function prep-fun
                                              :html-head "<link rel=\"stylesheet\" href=\"../tufte.min.css\" type=\"text/css\"/>"))))


#+end_src

#+RESULTS:
| dld | :publishing-directory | /home/mik-wsl/joegame/public/dld | :base-directory | /home/mik-wsl/joegame/site/dld | :with-toc | nil | :html-head-include-default-style | nil | :html-doctype | html5 | :htmlized-source | nil | :htmlize-output | nil | :with-title | nil | :with-broken-links | 't | :html-html5-fancy | 't | :completion-function | dld-copy-css | :preparation-function | prep-fun | :html-head | <link rel="stylesheet" href="../tufte.min.css" type="text/css"/> |

* dev server
A server to keep us going fast.  Really fast!
#+begin_src elisp
(save-buffer)
(org-publish "dld")
(if dld-running-dev-server
    (progn
      (delete-process "dld-http")
      (setq dld-running-dev-server nil)))
(setq dld-dev-server-http-server-bin (concat (expand-file-name (project-root (project-current)))
                                             "node_modules/http-server/bin/http-server"))
(setq dld-running-dev-server
      (start-process "dld-http" "**DLD HTTP SERVER**" dld-dev-server-http-server-bin (concat (expand-file-name (project-root (project-current))) "public")))
#+end_src

#+RESULTS:
: #<process dld-http>
